package zmn.w.uiutility.importantRecord;

/**
 * @作者 做就行了！
 * @时间 2019/1/25 0025
 * @使用说明：
 */
public class thought {
    /**
     * step 流程：
     * 1、先写参数类。
     * 2、按顺序创建窗口。
     */
    /**
     * step 确定：
     * 1、隐藏窗口方法：
     *    width和height设置为1，
     *    坐标设置在右上角，
     *    设置为INVISIBLE。
     *
     */
    /**
     * step 适当的花里花哨：
     * 1、用户可设置渐变色，从哪个位置开始渐变。
     */
//    新悬浮球思路：
//            1月25日：
//            1、主窗口在右下角。
//    上方最近任务窗口，显示4个。
//    下方常用应用，1至1.5厘米一个。
//            2、最近任务可以拖动。
//            3、功能：是否显示最近任务栏。
//            4、触发条件(距离、时间等)，这些变量写成一个类，方便用户更改。
//            5、CPU字体颜色，及其背景透明度。
//            6、主窗体是一个textview，可以设置是否显示CPU。
//            7、参数类标记习惯。
//            8、参数类多使用synchronize。
//            1月22日：
//            1、不能用overlay级别的窗口。
//    好像只能用了。
//            2、注意释放activity节省内存。
//            1月20日：
//            1、设置个最近任务栏。
//            2、右上角显示4个最近任务。
//
//            10月4日：
//    Overlay上边覆盖一个Toast接收命令。
//
//            10月24日：短时间闹钟提醒，震动。
//            12月8日：定时飞行模式。
}
